---
kind: type
id: T:Autodesk.Revit.DB.Revision
source: html/af882c60-68ae-2e53-5c41-7aa43cfc1df4.htm
---
# Autodesk.Revit.DB.Revision

Represents a single revision in the project.

## Syntax (C#)
```csharp
public class Revision : Element
```

## Remarks
The Revision object represents the data related to a single revision in the project.
 Revision clouds and tags can be associated with a particular Revision object to display
 its properties on sheets.
 The revisions in the project are stored in a specific order called the revision
 sequence. The revision sequence represents the conceptual sequence in which revisions
 will be issued.